src/main/test/supply-chain/5-Smoke Tests/2-Control Tax/0-Finalization/1-TC01.09_Simulate_ApplyTax/1-TC01_02_02.03_Simulate_ApplyTax_2/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:con="http://controlTax.ws.tim.ikea.com/">
   <soap:Header/>
   <soap:Body>
      <con:controlTax>
     <arg0>
  <DocumentId>
               <SystemSourceId>COMPASS001</SystemSourceId>
               <TransactionId>1000035624</TransactionId>
            </DocumentId>
            <AlternateDocumentId>
               <CustomField1>UAT_CTE_TC2.1.20</CustomField1>
               <CustomField2/>
               <CustomField3/>
               <CustomField4/>
               <CustomField5/>
               <CustomField6/>
               <CustomField7/>
               <CustomField8/>
               <CustomField9/>
               <CustomField10/>
            </AlternateDocumentId>
            <InvoiceLanguage>
               <LanguageCode>en</LanguageCode>
               <LanguageCountryCode>GB</LanguageCountryCode>
            </InvoiceLanguage>
            <CommunicationLanguage>
               <LanguageCode>en</LanguageCode>
               <LanguageCountryCode>GB</LanguageCountryCode>
            </CommunicationLanguage>
            <PreviousInvoiceTaxCountry/>
            <TaxDecisionSet>
               <TaxDecisionSetId>1</TaxDecisionSetId>
               <SellerTaxIndicator>
                  <TaxIndicatorAbbreviation>MAT_DOM</TaxIndicatorAbbreviation>
                  <TaxIndicatorName>Domestic Tax</TaxIndicatorName>
                  <TaxIndicatorComment>Domestic transaction</TaxIndicatorComment>
               </SellerTaxIndicator>
               <SellerTaxCountry>DE</SellerTaxCountry>
               <SellerTaxState>NULL</SellerTaxState>
               <BuyerTaxIndicator>
                  <TaxIndicatorAbbreviation>MAT_DOM</TaxIndicatorAbbreviation>
                  <TaxIndicatorName>Domestic Tax</TaxIndicatorName>
                  <TaxIndicatorComment>Domestic transaction</TaxIndicatorComment>
               </BuyerTaxIndicator>
               <BuyerTaxCountry>DE</BuyerTaxCountry>
               <BuyerTaxState>NULL</BuyerTaxState>
               <CombinedTaxIndicator>DOM</CombinedTaxIndicator>
               <CommercialIndicator>C</CommercialIndicator>
               <SellerTaxRegCountry>DE</SellerTaxRegCountry>
               <SellerTaxRegState>NULL</SellerTaxRegState>
               <BuyerTaxRegCountry>DE</BuyerTaxRegCountry>
               <BuyerTaxRegState>NULL</BuyerTaxRegState>
               <SellerTaxTotal>
                  <NetAmount>50.00</NetAmount>
                  <TaxAmount>3.50</TaxAmount>
                  <GrossAmount>53.50</GrossAmount>
                  <TaxAmountInLocalCurrency>0</TaxAmountInLocalCurrency>
                  <TaxInvoiceSubTotal>
                     <TaxType>
                        <TaxTypeName>DV</TaxTypeName>
                        <TaxTypeAbbreviation>VAT</TaxTypeAbbreviation>
                        <TaxTypeDescription>VALUE ADDED TAX</TaxTypeDescription>
                     </TaxType>
                     <TaxCode>2</TaxCode>
                     <TaxRate>7.0</TaxRate>
                     <NetAmount>50.00</NetAmount>
                     <TaxAmount>3.50</TaxAmount>
                     <GrossAmount>53.50</GrossAmount>
                     <TaxAmountInLocalCurrency>0</TaxAmountInLocalCurrency>
                  </TaxInvoiceSubTotal>
               </SellerTaxTotal>
               <BuyerTaxTotal>
                  <NetAmount>50.00</NetAmount>
                  <TaxAmount>3.50</TaxAmount>
                  <GrossAmount>53.50</GrossAmount>
                  <TaxAmountInLocalCurrency>0</TaxAmountInLocalCurrency>
                  <TaxInvoiceSubTotal>
                     <TaxType>
                        <TaxTypeName>DV</TaxTypeName>
                        <TaxTypeAbbreviation>VAT</TaxTypeAbbreviation>
                        <TaxTypeDescription>VALUE ADDED TAX</TaxTypeDescription>
                     </TaxType>
                     <TaxCode>2</TaxCode>
                     <TaxRate>7.0</TaxRate>
                     <NetAmount>50.00</NetAmount>
                     <TaxAmount>3.50</TaxAmount>
                     <GrossAmount>53.50</GrossAmount>
                     <TaxAmountInLocalCurrency>0</TaxAmountInLocalCurrency>
                  </TaxInvoiceSubTotal>
               </BuyerTaxTotal>
               <TaxComment>
                  <TaxCommentType/>
                  <TaxCommentText/>
               </TaxComment>
               <InvoiceCurrency>
                  <CurrencyCode>EUR</CurrencyCode>
                  <SellerLocalTaxCurrencyCode/>
                  <BuyerLocalTaxCurrencyCode/>
               </InvoiceCurrency>
               <LegalTaxCalculationLevel>L</LegalTaxCalculationLevel>
               <TaxInvoiceLine>
                  <LineNumber>1</LineNumber>
                  <ItemNo>56000000</ItemNo>
                  <ItemType/>
                  <UNSPSC>5</UNSPSC>
                  <Classification>M</Classification>
                  <SubClassification>GOODS</SubClassification>
                  <CountryItemClassification/>
                  <NetAmount>50.00</NetAmount>
                  <SellerTax>
                     <SellerTaxCountry>
                        <TaxCalculationLineComponent>
                           <TaxAmount>3.50</TaxAmount>
                           <GrossAmount>53.50</GrossAmount>
                           <TaxAmountInLocalCurrency>0</TaxAmountInLocalCurrency>
                           <TaxCode>2</TaxCode>
                           <TaxType>
                              <TaxTypeName>DV</TaxTypeName>
                              <TaxTypeAbbreviation>VAT</TaxTypeAbbreviation>
                              <TaxTypeDescription>VALUE ADDED TAX</TaxTypeDescription>
                           </TaxType>
                           <TaxRate>7.0</TaxRate>
                        </TaxCalculationLineComponent>
                     </SellerTaxCountry>
                  </SellerTax>
                  <VariableTaxSteeringInput>
                     <ConsignorCountry>CH</ConsignorCountry>
                     <ConsignorState/>
                     <ConsignorBusinessUnitCode>5100</ConsignorBusinessUnitCode>
                     <ConsignorBusinessUnitType>COM</ConsignorBusinessUnitType>
                     <ConsigneeCountry>DE</ConsigneeCountry>
                     <ConsigneeState>DENW</ConsigneeState>
                     <ConsigneeBusinessUnitCode>119</ConsigneeBusinessUnitCode>
                     <ConsigneeBusinessUnitType>STO</ConsigneeBusinessUnitType>
                     <CarrierCountry/>
                     <CarrierState/>
                     <CarrierBusinessUnitCode/>
                     <CarrierBusinessUnitType/>
                     <ShipmentStartCountry/>
                     <ShipmentEndCountry/>
                     <ShipmentStartState/>
                     <ShipmentEndState/>
                     <ServiceRenderedCountry/>
                     <ServiceRenderedState/>
                     <ResalePurpose/>
                     <IsOutBonded/>
                     <IsInBonded/>
                     <TaxPreAlgorithmOutput>
                        <IsExport/>
                        <IsImport/>
                        <IsExported/>
                        <IsImported/>
                     </TaxPreAlgorithmOutput>
                     <ShippingOfCustomsClearedGoods/>
                  </VariableTaxSteeringInput>
                  <BuyerTax>
                     <BuyerTaxCountry>
                        <TaxCalculationLineComponent>
                           <TaxAmount>3.50</TaxAmount>
                           <GrossAmount>53.50</GrossAmount>
                           <TaxAmountInLocalCurrency>0</TaxAmountInLocalCurrency>
                           <TaxCode>2</TaxCode>
                           <TaxType>
                              <TaxTypeName>DV</TaxTypeName>
                              <TaxTypeAbbreviation>VAT</TaxTypeAbbreviation>
                              <TaxTypeDescription>VALUE ADDED TAX</TaxTypeDescription>
                           </TaxType>
                           <TaxRate>7.0</TaxRate>
                        </TaxCalculationLineComponent>
                     </BuyerTaxCountry>
                  </BuyerTax>
               </TaxInvoiceLine>
               <SellerTaxInformation>
                  <TaxRegistration>
                     <TaxRegistrationCountry>DE</TaxRegistrationCountry>
                     <TaxRegistrationNumberType>DV</TaxRegistrationNumberType>
                     <TaxRegistrationNumber>DE 249260936</TaxRegistrationNumber>
                     <TaxRegistrationNumberStateType/>
                     <TaxRegistrationNumberState/>
                  </TaxRegistration>
                  <TaxRepresentative>
                     <TaxParty>
                        <BusinessUnitCode/>
                        <BusinessUnitType/>
                        <BusinessUnitName/>
                     </TaxParty>
                     <TaxRegistration>
                        <TaxRegistrationCountry/>
                        <TaxRegistrationNumberType/>
                        <TaxRegistrationNumber/>
                        <TaxRegistrationState/>
                        <TaxRegistrationNumberStateType/>
                        <TaxRegistrationNumberState/>
                     </TaxRegistration>
                     <PartyAddress>
                        <AddressType/>
                        <City/>
                        <PostBox/>
                        <Street/>
                        <ZipCode/>
                        <CountryCode/>
                        <StateCode/>
                        <CountryOfLegalRegistration/>
                     </PartyAddress>
                  </TaxRepresentative>
               </SellerTaxInformation>
               <BuyerTaxInformation>
                  <TaxRegistration>
                     <TaxRegistrationCountry>DE</TaxRegistrationCountry>
                     <TaxRegistrationNumberType>DV</TaxRegistrationNumberType>
                     <TaxRegistrationNumber>DE 130 504 827</TaxRegistrationNumber>
                     <TaxRegistrationNumberStateType/>
                     <TaxRegistrationNumberState/>
                  </TaxRegistration>
                  <TaxRepresentative>
                     <TaxParty>
                        <BusinessUnitCode/>
                        <BusinessUnitType/>
                        <BusinessUnitName/>
                     </TaxParty>
                     <TaxRegistration>
                        <TaxRegistrationCountry/>
                        <TaxRegistrationNumberType/>
                        <TaxRegistrationNumber/>
                        <TaxRegistrationState/>
                        <TaxRegistrationNumberStateType/>
                        <TaxRegistrationNumberState/>
                     </TaxRegistration>
                     <PartyAddress>
                        <AddressType/>
                        <City/>
                        <PostBox/>
                        <Street/>
                        <ZipCode/>
                        <CountryCode/>
                        <StateCode/>
                        <CountryOfLegalRegistration/>
                     </PartyAddress>
                  </TaxRepresentative>
               </BuyerTaxInformation>
            </TaxDecisionSet>
            <TaxDate>
               <TaxAlgorithmDate>2014-07-03</TaxAlgorithmDate>
            </TaxDate>
            <TaxModuleBehaviour>
               <SkipCalculation>N</SkipCalculation>
               <SkipDecision>N</SkipDecision>
            </TaxModuleBehaviour>
            <VariableTaxSteeringInput>
               <ConsignorCountry/>
               <ConsignorState/>
               <ConsignorBusinessUnitCode/>
               <ConsignorBusinessUnitType/>
               <ConsigneeCountry/>
               <ConsigneeState/>
               <ConsigneeBusinessUnitCode/>
               <ConsigneeBusinessUnitType/>
               <CarrierCountry/>
               <CarrierState/>
               <CarrierBusinessUnitCode/>
               <CarrierBusinessUnitType/>
               <ShipmentStartCountry/>
               <ShipmentEndCountry/>
               <ShipmentStartState/>
               <ShipmentEndState/>
               <ServiceRenderedCountry/>
               <ServiceRenderedState/>
               <ResalePurpose>Y</ResalePurpose>
               <IsOutBonded>N</IsOutBonded>
               <IsInBonded>N</IsInBonded>
               <TaxPreAlgorithmOutput>
                  <IsExport>N</IsExport>
                  <IsImport>Y</IsImport>
                  <IsExported>N</IsExported>
                  <IsImported>Y</IsImported>
               </TaxPreAlgorithmOutput>
               <ShippingOfCustomsClearedGoods/>
            </VariableTaxSteeringInput>
            <BuyerParty>
               <Party>
                  <BusinessUnitCode>1206</BusinessUnitCode>
                  <BusinessUnitType>COM</BusinessUnitType>
                  <BusinessUnitName/>
                  <PartyAddress>
                     <AddressType>MAIN</AddressType>
                     <City>HOFHEIM-WALLAU</City>
                     <PostBox/>
                     <Street>AM WANDERSMANN 2-4</Street>
                     <ZipCode>65719</ZipCode>
                     <CountryCode>DE</CountryCode>
                     <StateCode>DEHE</StateCode>
                     <CountryOfLegalRegistration>DE</CountryOfLegalRegistration>
                  </PartyAddress>
               </Party>
            </BuyerParty>
            <SellerParty>
               <Party>
                  <BusinessUnitCode>5100</BusinessUnitCode>
                  <BusinessUnitType>COM</BusinessUnitType>
                  <BusinessUnitName/>
                  <PartyAddress>
                     <AddressType>MAIN</AddressType>
                     <City>PRATTELN</City>
                     <PostBox/>
                     <Street>GRUESSENWEG 15</Street>
                     <ZipCode>4133</ZipCode>
                     <CountryCode>CH</CountryCode>
                     <StateCode/>
                     <CountryOfLegalRegistration/>
                  </PartyAddress>
               </Party>
            </SellerParty>
            <TermOfDelivery/>
  </arg0>
      </con:controlTax>
   </soap:Body>
</soap:Envelope>